app/views/sub_categories/_form.html.erb

SELECT "categories".* FROM "categories"
---

<%= select_tag("sub_category[category_id]",  options_for_select(@category.map{|c|["#{c.descripcion}", c.id]})) %>