app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("descripcion", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descripcion", "faljkdshfkj"], ["created_at", "2017-11-08 02:22:04.672066"], ["updated_at", "2017-11-08 02:22:04.672066"]]