app/controllers/marcas_controller.rb

  def index
    @marcas = Marca.all
    @prov = Proveedore.all
    @marca_proveedor = MarcaProveedor.all
---
SELECT "marcas".* FROM "marcas"
SELECT "proveedores".* FROM "proveedores"
SELECT "marca_proveedors".* FROM "marca_proveedors"

  def create
    @marca = Marca.new(marca_params)

    respond_to do |format|
      if @marca.save
---
INSERT INTO "marcas" ("descrip", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descrip", "speed"], ["created_at", "2017-11-07 17:08:52.581323"], ["updated_at", "2017-11-07 17:08:52.581323"]]

    def set_marca
      @marca = Marca.find(params[:id])
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = $1 LIMIT 1  [["id", 1]]