app/controllers/proveedores_controller.rb

SELECT "proveedores".* FROM "proveedores"
---
  def index
    @proveedores = Proveedore.all

INSERT INTO "proveedores" ("nombre", "ruc", "contacto", "direccion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "la yutenha"], ["ruc", "151"], ["contacto", "asdf"], ["direccion", "asfd"], ["created_at", "2017-11-06 02:44:16.666408"], ["updated_at", "2017-11-06 02:44:16.666408"]]
---
  def create
    @proveedore = Proveedore.new(proveedore_params)

    respond_to do |format|
      if @proveedore.save

UPDATE "proveedores" SET "ruc" = $1, "updated_at" = $2 WHERE "proveedores"."id" = $3  [["ruc", "554545"], ["updated_at", "2017-11-11 19:18:46.329550"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @proveedore.update(proveedore_params)

SELECT  "proveedores".* FROM "proveedores" WHERE "proveedores"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_proveedore
      @proveedore = Proveedore.find(params[:id])