app/controllers/sub_categories_controller.rb

SELECT "sub_categories".* FROM "sub_categories"
---
  def index
    @sub_categories = SubCategory.all

SELECT "categories".* FROM "categories"
---
  def new
    @sub_category = SubCategory.new
    @category = Category.all

SELECT "categories".* FROM "categories"
---
  def edit
    @category = Category.all

INSERT INTO "sub_categories" ("descripcion", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["descripcion", "af"], ["category_id", 1], ["created_at", "2017-11-09 23:54:43.056449"], ["updated_at", "2017-11-09 23:54:43.056449"]]
---
  def create
    @sub_category = SubCategory.new(sub_category_params)
    @category = Category.all
    #.map { |c| [ c.descripcion, c.id ] }
    puts params

    respond_to do |format|
      if @sub_category.save

UPDATE "sub_categories" SET "category_id" = $1, "updated_at" = $2 WHERE "sub_categories"."id" = $3  [["category_id", 2], ["updated_at", "2017-11-09 03:35:03.708256"], ["id", 8]]
---
  def update
    @category = Category.all
    respond_to do |format|
      if @sub_category.update(sub_category_params)

DELETE FROM "sub_categories" WHERE "sub_categories"."id" = $1  [["id", 3]]
---
  def destroy
    @sub_category.destroy

SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_sub_category
      @sub_category = SubCategory.find(params[:id])