app/controllers/sucursals_controller.rb

  def index
    @sucursals = Sucursal.all
---
SELECT "sucursals".* FROM "sucursals"

  def create
    @sucursal = Sucursal.new(sucursal_params)

    respond_to do |format|
      if @sucursal.save
---
INSERT INTO "sucursals" ("nombre", "direccion", "localidad", "telefono", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @sucursal.destroy
---
DELETE FROM "sucursals" WHERE "sucursals"."id" = $1  [["id", 1]]

    def set_sucursal
      @sucursal = Sucursal.find(params[:id])
---
SELECT  "sucursals".* FROM "sucursals" WHERE "sucursals"."id" = $1 LIMIT 1  [["id", 1]]